app/controllers/exam_controller.rb

SELECT * FROM `batches` WHERE (`batches`.`id` = 1)
SELECT * FROM `exam_groups` WHERE (`exam_groups`.`batch_id` = 1)
---
  def list_exam_types
    batch = Batch.find(params[:batch_id])
    @exam_groups = ExamGroup.find_all_by_batch_id(batch.id)

SELECT * FROM `exam_groups` WHERE (`exam_groups`.`id` = 2)
SELECT * FROM `students` WHERE (`students`.batch_id = 1)
SELECT * FROM `subjects` WHERE (elective_group_id IS NULL) AND (`subjects`.`batch_id` = 1)
SELECT * FROM `students_subjects` WHERE (batch_id = 1) AND (`students_subjects`.`student_id` = 3)
SELECT * FROM `subjects` WHERE (`subjects`.`id` = 5)
SELECT * FROM `exams` WHERE (`exams`.`exam_group_id` = 2 AND `exams`.`subject_id` = 1) LIMIT 1
---
  def generated_report
    if params[:student].nil?
      if params[:exam_report].nil? or params[:exam_report][:exam_group_id].empty?
        flash[:notice] = "#{t('flash2')}"
        redirect_to :action=>'exam_wise_report' and return
      end
    else
      if params[:exam_group].nil?
        flash[:notice] = "#{t('flash3')}"
        redirect_to :action=>'exam_wise_report' and return
      end
    end
    if params[:student].nil?
      @exam_group = ExamGroup.find(params[:exam_report][:exam_group_id])
      @batch = @exam_group.batch
      @students=@batch.students.by_first_name
      @student = @students.first  unless @students.empty?
      if @student.nil?
        flash[:notice] = "#{t('flash_student_notice')}"
        redirect_to :action => 'exam_wise_report' and return
      end
      general_subjects = Subject.find_all_by_batch_id(@batch.id, :conditions=>"elective_group_id IS NULL")
      student_electives = StudentsSubject.find_all_by_student_id(@student.id,:conditions=>"batch_id = #{@batch.id}")
      elective_subjects = []
      student_electives.each do |elect|
        elective_subjects.push Subject.find(elect.subject_id)
      end
      @subjects = general_subjects + elective_subjects
      @exams = []
      @subjects.each do |sub|
        exam = Exam.find_by_exam_group_id_and_subject_id(@exam_group.id,sub.id)

SELECT * FROM `batches` WHERE (`batches`.`id` = 1)
---
      @graph = open_flash_chart_object(770, 350,
        "/exam/graph_for_generated_report?batch=#{@student.batch.id}&examgroup=#{@exam_group.id}&student=#{@student.id}")
    else
      @exam_group = ExamGroup.find(params[:exam_group])

SELECT * FROM `exam_groups` WHERE (`exam_groups`.`id` = 2)
---
  def consolidated_exam_report
    @exam_group = ExamGroup.find(params[:exam_group])

SELECT * FROM `exam_groups` WHERE (`exam_groups`.`id` = 1)
---
  def consolidated_exam_report_pdf
    @exam_group = ExamGroup.find(params[:exam_group])

SELECT * FROM `subjects` WHERE (is_deleted=false) AND (`subjects`.`batch_id` = '1')
---
  def list_batch_subjects
    @subjects = Subject.find_all_by_batch_id(params[:batch_id],:conditions=>"is_deleted=false")

SELECT * FROM `subjects` WHERE (is_deleted=false) AND (`subjects`.`batch_id` = '1')
---
  def list_subjects
    @subjects = Subject.find_all_by_batch_id(params[:batch_id],:conditions=>"is_deleted=false")

SELECT * FROM `subjects` WHERE (`subjects`.`id` = 1)
SELECT * FROM `batches` WHERE (`batches`.`id` = 1)
SELECT * FROM `exam_groups` WHERE (`exam_groups`.`batch_id` = 1)
SELECT * FROM `students` WHERE (`students`.batch_id = 1)
---
  def generated_report2
    #subject-wise-report-for-batch
    unless params[:exam_report][:subject_id] == ""
      @subject = Subject.find(params[:exam_report][:subject_id])
      @batch = @subject.batch
      @students = @batch.students
      @exam_groups = ExamGroup.find(:all,:conditions=>{:batch_id=>@batch.id})

SELECT * FROM `courses` WHERE (`courses`.`id` = 1)
---
  def batch_groups
    unless params[:course_id]==""
      @course = Course.find(params[:course_id])

SELECT * FROM `courses` WHERE (`courses`.`id` = 1)
SELECT * FROM `batches` WHERE (`batches`.`id` IN (1,2))
SELECT * FROM `students` WHERE (`students`.`batch_id` IN (1,2))
SELECT * FROM `grouped_exams` WHERE (`grouped_exams`.`batch_id` IN (1,2))
SELECT count(*) AS count_all FROM `batch_groups` WHERE (`batch_groups`.course_id = 1)
---
  def student_course_rank
    if params[:course_rank].nil? or params[:course_rank][:course_id]==""
      flash[:notice] = "#{t('flash13')}"
      redirect_to :action=>'course_rank' and return
    else
      @course = Course.find(params[:course_rank][:course_id])
      if @course.has_batch_groups_with_active_batches and (!params[:course_rank][:batch_group_id].present? or params[:course_rank][:batch_group_id]=="")
        flash[:notice] = "#{t('flash14')}"
        redirect_to :action=>'course_rank' and return
      else
        if @course.has_batch_groups_with_active_batches
          @batch_group = BatchGroup.find(params[:course_rank][:batch_group_id])
          @batches = @batch_group.batches
        else
          @batches = @course.active_batches
        end
        @students = Student.find_all_by_batch_id(@batches)
        @grouped_exams = GroupedExam.find_all_by_batch_id(@batches)
        @sort_order=""
        unless !params[:sort_order].present?
          @sort_order=params[:sort_order]
        end
        @ranked_students = @course.find_course_rank(@batches.collect(&:id),@sort_order).paginate(:page => params[:page], :per_page=>25)

SELECT * FROM `courses` WHERE (`courses`.`id` = 1)
SELECT * FROM `students` WHERE (`students`.`batch_id` IN (1,2))
SELECT * FROM `grouped_exams` WHERE (`grouped_exams`.`batch_id` IN (1,2))
SELECT * FROM `batches` WHERE (`batches`.`id` IN (1,2))
---
  def student_course_rank_pdf
    @course = Course.find(params[:course_id])
    if @course.has_batch_groups_with_active_batches
      @batch_group = BatchGroup.find(params[:batch_group_id])
      @batches = @batch_group.batches
    else
      @batches = @course.active_batches
    end
    @students = Student.find_all_by_batch_id(@batches)
    @grouped_exams = GroupedExam.find_all_by_batch_id(@batches)
    @sort_order=""
    unless !params[:sort_order].present?
      @sort_order=params[:sort_order]
    end
    @ranked_students = @course.find_course_rank(@batches.collect(&:id),@sort_order)

SELECT * FROM `courses` WHERE (`courses`.`is_deleted` = 0)
SELECT * FROM `batches` WHERE (`batches`.`is_deleted` = 0 AND `batches`.`course_id` IN (1,2) AND `batches`.`is_active` = 1)
SELECT * FROM `students` WHERE (`students`.`batch_id` IN (1,2,3,4))
SELECT * FROM `grouped_exams` WHERE (`grouped_exams`.`batch_id` IN (1,2,3,4))
---
  def student_school_rank
    @courses = Course.all(:conditions=>{:is_deleted=>false})
    @batches = Batch.all(:conditions=>{:course_id=>@courses,:is_deleted=>false,:is_active=>true})
    @students = Student.find_all_by_batch_id(@batches)
    @grouped_exams = GroupedExam.find_all_by_batch_id(@batches)

SELECT * FROM `batches` WHERE (`batches`.`id` IN (1,2,3,4))
---
  def load_batch_students
    unless params[:id].nil? or params[:id]==""
      @batch = Batch.find(params[:id])

SELECT * FROM `grouped_exams` WHERE (`grouped_exams`.`batch_id` = 1)
---
  def final_report_type
    batch = Batch.find(params[:batch_id])
    @grouped_exams = GroupedExam.find_all_by_batch_id(batch.id)

SELECT * FROM `grouped_exams` WHERE (`grouped_exams`.`batch_id` = 1)
SELECT * FROM `exam_groups` WHERE (`exam_groups`.`id` = 1)
SELECT * FROM `exams` WHERE (`exams`.`exam_group_id` IN (1,2))
---
  def generated_report4
    if params[:student].nil?
      if params[:exam_report].nil? or params[:exam_report][:batch_id].empty?
        flash[:notice] = "#{t('select_a_batch_to_continue')}"
        redirect_to :action=>'grouped_exam_report' and return
      end
    else
      if params[:type].nil?
        flash[:notice] = "#{t('invalid_parameters')}"
        redirect_to :action=>'grouped_exam_report' and return
      end
    end
    #grouped-exam-report-for-batch
    if params[:student].nil?
      @type = params[:type]
      @batch = Batch.find(params[:exam_report][:batch_id])
      @students=@batch.students.by_first_name
      @student = @students.first  unless @students.empty?
      if @student.blank?
        flash[:notice] = "#{t('flash5')}"
        redirect_to :action=>'grouped_exam_report' and return
      end
      if @type == 'grouped'
        @grouped_exams = GroupedExam.find_all_by_batch_id(@batch.id)
        @exam_groups = []
        @grouped_exams.each do |x|
          @exam_groups.push ExamGroup.find(x.exam_group_id)

SELECT * FROM `subjects` WHERE (elective_group_id IS NULL AND is_deleted=false) AND (`subjects`.`batch_id` = 1)
SELECT * FROM `students_subjects` WHERE (batch_id = 1) AND (`students_subjects`.`student_id` = 3)
SELECT * FROM `subjects` WHERE (`subjects`.`id` = 5)
---
        @exam_groups = ExamGroup.find_all_by_batch_id(@batch.id)
        @exam_groups.reject!{|e| e.result_published==false}
      end
      general_subjects = Subject.find_all_by_batch_id(@batch.id, :conditions=>"elective_group_id IS NULL AND is_deleted=false")
      student_electives = StudentsSubject.find_all_by_student_id(@student.id,:conditions=>"batch_id = #{@batch.id}")
      elective_subjects = []
      student_electives.each do |elect|
        elective_subjects.push Subject.find(elect.subject_id)

SELECT * FROM `exams` WHERE (`exams`.`subject_id` = 1 AND `exams`.`exam_group_id` = 1) LIMIT 1
SELECT * FROM `students` WHERE (`students`.`id` = 3)
---
      @subjects = general_subjects + elective_subjects
      @subjects.reject!{|s| s.no_exams==true}
      exams = Exam.find_all_by_exam_group_id(@exam_groups.collect(&:id))
      subject_ids = exams.collect(&:subject_id)
      @subjects.reject!{|sub| !(subject_ids.include?(sub.id))}
    else
      @student = Student.find(params[:student])

SELECT * FROM `students` WHERE (`students`.`id` = 3)
SELECT * FROM `grouped_exams` WHERE (`grouped_exams`.`batch_id` = 1)
SELECT * FROM `exam_groups` WHERE (`exam_groups`.`id` = 1)
SELECT * FROM `exams` WHERE (`exams`.`exam_group_id` IN (1,2))
SELECT * FROM `subjects` WHERE (elective_group_id IS NULL) AND (`subjects`.`batch_id` = 1)
SELECT * FROM `students_subjects` WHERE (batch_id = 1) AND (`students_subjects`.`student_id` = 3)
SELECT * FROM `subjects` WHERE (`subjects`.`id` = 5)
SELECT * FROM `exams` WHERE (`exams`.`exam_group_id` = 1 AND `exams`.`subject_id` = 1) LIMIT 1
---
  def generated_report4_pdf
    #grouped-exam-report-for-batch
    if params[:student].nil?
      @type = params[:type]
      @batch = Batch.find(params[:exam_report][:batch_id])
      @student = @batch.students.first
      if @type == 'grouped'
        @grouped_exams = GroupedExam.find_all_by_batch_id(@batch.id)
        @exam_groups = []
        @grouped_exams.each do |x|
          @exam_groups.push ExamGroup.find(x.exam_group_id)
        end
      else
        @exam_groups = ExamGroup.find_all_by_batch_id(@batch.id)
        @exam_groups.reject!{|e| e.result_published==false}
      end
      general_subjects = Subject.find_all_by_batch_id(@batch.id, :conditions=>"elective_group_id IS NULL and is_deleted=false")
      student_electives = StudentsSubject.find_all_by_student_id(@student.id,:conditions=>"batch_id = #{@batch.id}")
      elective_subjects = []
      student_electives.each do |elect|
        elective_subjects.push Subject.find(elect.subject_id,:conditions => {:is_deleted => false})
      end
      @subjects = general_subjects + elective_subjects
      @subjects.reject!{|s| s.no_exams==true}
      exams = Exam.find_all_by_exam_group_id(@exam_groups.collect(&:id))
      subject_ids = exams.collect(&:subject_id)

SELECT * FROM `grouped_exams` WHERE (`grouped_exams`.`batch_id` IN (1,2))
SELECT * FROM `students` WHERE (`students`.`batch_id` IN (1,2))
SELECT * FROM `exam_groups` WHERE (`exam_groups`.`id` = 1)
SELECT * FROM `exams` WHERE (`exams`.`exam_group_id` IN (1,2))
---
  def combined_grouped_exam_report_pdf
    @type = params[:type]
    @batch = Batch.find(params[:batch])
    @students = @batch.students.by_first_name
    if @type == 'grouped'
      @grouped_exams = GroupedExam.find_all_by_batch_id(@batch.id)
      @exam_groups = []
      @grouped_exams.each do |x|
        @exam_groups.push ExamGroup.find(x.exam_group_id)

SELECT * FROM `privileges` INNER JOIN `privileges_users` ON `privileges`.id = `privileges_users`.privilege_id WHERE (`privileges_users`.user_id = 1 )
SELECT * FROM `courses` WHERE (`courses`.`is_deleted` = 0) ORDER BY code asc
---
  def create_exam
    privilege = current_user.privileges.map{|p| p.name}
    if current_user.admin or privilege.include?("ExaminationControl") or privilege.include?("EnterResults")
      @course= Course.find(:all,:conditions => { :is_deleted => false }, :order => 'code asc')

SELECT * FROM `batches` WHERE (`batches`.`is_deleted` = 0 AND `batches`.`is_active` = 1) AND (`batches`.`course_id` = '1')
---
  def update_batch
    @batch = Batch.find_all_by_course_id(params[:course_name], :conditions => { :is_deleted => false, :is_active => true })

SELECT * FROM `students` WHERE (`students`.`id` = 3)
SELECT * FROM `exam_groups` WHERE (`exam_groups`.`id` = 2)
SELECT * FROM `subjects` WHERE (elective_group_id IS NULL) AND (`subjects`.`batch_id` = 1)
SELECT * FROM `students_subjects` WHERE (batch_id = 1) AND (`students_subjects`.`student_id` = 3)
SELECT * FROM `subjects` WHERE (`subjects`.`id` = 5)
SELECT * FROM `exams` WHERE (`exams`.`exam_group_id` = 2 AND `exams`.`subject_id` = 1) LIMIT 1
SELECT * FROM `exam_scores` WHERE (`exam_scores`.`exam_id` = 9 AND `exam_scores`.`student_id` = 3) LIMIT 1
---
  def graph_for_generated_report
    student = Student.find(params[:student])
    examgroup = ExamGroup.find(params[:examgroup])
    batch = student.batch
    general_subjects = Subject.find_all_by_batch_id(batch.id, :conditions=>"elective_group_id IS NULL")
    student_electives = StudentsSubject.find_all_by_student_id(student.id,:conditions=>"batch_id = #{batch.id}")
    elective_subjects = []
    student_electives.each do |elect|
      elective_subjects.push Subject.find(elect.subject_id)
    end
    subjects = general_subjects + elective_subjects

    x_labels = []
    data = []
    data2 = []

    subjects.each do |s|
      exam = Exam.find_by_exam_group_id_and_subject_id(examgroup.id,s.id)
      res = ExamScore.find_by_exam_id_and_student_id(exam, student)